# The Pandas DataFrame Object

A DataFrame represents a ractangler table of data, and contains an ordered collection of columns, each of which can be a different value type.

In [88]:
import numpy as np 
import pandas as pd

In [89]:
#Create a DataFrame from a 2-D ndarray
df = pd.DataFrame(np.array([ [10,11,12,13],[20,21,22,23] ]))
df

    0   1   2   3
0  10  11  12  13
1  20  21  22  23

In [90]:
#Create a DataFrame for a list of series objects
df1 = pd.DataFrame( [pd.Series(np.arange(10, 15)),
                    pd.Series(np.arange(15, 20))] )
df1

    0   1   2   3   4
0  10  11  12  13  14
1  15  16  17  18  19

In [91]:
#Create a DataFrame with two series objects and a dictionary
s1 = pd.Series(np.arange(1, 6, 1))
s2 = pd.Series(np.arange(6, 11, 1))

df2 = pd.DataFrame({'boys': s1, 'girls': s2})
df2

   boys  girls
0     1      6
1     2      7
2     3      8
3     4      9
4     5     10

In [92]:
#Create a DataFrame with dictionary
data = {
            'name':   ["Asad", "Saad", "Fahad", "Ali"], 
            "age":    [23, 34, 23, 21], 
            "grades": ["A", "B", "C", "D"]
       }
data = pd.DataFrame(data)
data

    name  age grades
0   Asad   23      A
1   Saad   34      B
2  Fahad   23      C
3    Ali   21      D

In [93]:
#Specify column name
df3 = pd.DataFrame(np.array([ [10,11], [20,21] ]), columns=["apples", "oranges"])
df3

   apples  oranges
0      10       11
1      20       21

In [94]:
#Create a DataFrame with named columns and rows
df4 = pd.DataFrame(np.array([ [10,11,12,13],[20,21,22,23] ]), index=['apples', 'oranges'], columns=['Mon', 'Tue', 'Wed', 'Thu'])

df4

         Mon  Tue  Wed  Thu
apples    10   11   12   13
oranges   20   21   22   23

In [95]:
data = {
    'state': ['Ohio','Ohio','Ohio','Neveda','Neveda','Neveda'], 
    'year':  [2000,2001,2002,2001,2002,2003],
    'pop': [1.5,1.7,3.6,2.4,2.9,3.2]
}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Neveda  2001  2.4
4  Neveda  2002  2.9
5  Neveda  2003  3.2

In [96]:
#in-place = false
pd.DataFrame(frame, columns=['year','state','pop', 'imports'])

   year   state  pop  imports
0  2000    Ohio  1.5      NaN
1  2001    Ohio  1.7      NaN
2  2002    Ohio  3.6      NaN
3  2001  Neveda  2.4      NaN
4  2002  Neveda  2.9      NaN
5  2003  Neveda  3.2      NaN

In [97]:
#Select a column
frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [98]:
frame['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [99]:
frame2 = pd.DataFrame(data, columns=['year','state','pop','dept'], index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop dept
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Neveda  2.4  NaN
five   2002  Neveda  2.9  NaN
six    2003  Neveda  3.2  NaN

In [100]:
#Enter 100 (const) in dept column
frame2.dept = "100"
frame2

       year   state  pop dept
one    2000    Ohio  1.5  100
two    2001    Ohio  1.7  100
three  2002    Ohio  3.6  100
four   2001  Neveda  2.4  100
five   2002  Neveda  2.9  100
six    2003  Neveda  3.2  100

In [101]:
#Enter 0-6 (range) numbers in dept column
frame2['dept'] = np.arange(6)
frame2

       year   state  pop  dept
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Neveda  2.4     3
five   2002  Neveda  2.9     4
six    2003  Neveda  3.2     5

In [102]:
#Enter (series) in dept column
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['dept'] = val
frame2

       year   state  pop  dept
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Neveda  2.4  -1.5
five   2002  Neveda  2.9  -1.7
six    2003  Neveda  3.2   NaN

In [103]:
#Adding column to dataframe with bool values where state(column) has 'Ohio' value
frame2['eastern'] = frame2.state == 'Ohio' #ture/false
frame2

       year   state  pop  dept  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Neveda  2.4  -1.5    False
five   2002  Neveda  2.9  -1.7    False
six    2003  Neveda  3.2   NaN    False

In [104]:
#Adding column to dataframe with bool values where pop(column) has value > 2
frame2['greaterThenTwo'] = frame2['pop'] > 2
frame2

       year   state  pop  dept  eastern  greaterThenTwo
one    2000    Ohio  1.5   NaN     True           False
two    2001    Ohio  1.7  -1.2     True           False
three  2002    Ohio  3.6   NaN     True            True
four   2001  Neveda  2.4  -1.5    False            True
five   2002  Neveda  2.9  -1.7    False            True
six    2003  Neveda  3.2   NaN    False            True

In [105]:
#Delete eastern column
del frame2['eastern']

In [106]:
frame2

       year   state  pop  dept  greaterThenTwo
one    2000    Ohio  1.5   NaN           False
two    2001    Ohio  1.7  -1.2           False
three  2002    Ohio  3.6   NaN            True
four   2001  Neveda  2.4  -1.5            True
five   2002  Neveda  2.9  -1.7            True
six    2003  Neveda  3.2   NaN            True

In [107]:
#Create a DataFrame with dictionary
data = {
            'name':             ["Asad", "Saad", "Fahad", "Ali"], 
            "age":              [23, 34, 23, 21], 
            "AIforEveryOne":    [89,78,90,98],
            "puthon":           [78,89,87,89],
            "git":              [90,98,87,86],
            "numpy":            [98,87,98,99]
       }
data = pd.DataFrame(data)
data

    name  age  AIforEveryOne  puthon  git  numpy
0   Asad   23             89      78   90     98
1   Saad   34             78      89   98     87
2  Fahad   23             90      87   87     98
3    Ali   21             98      89   86     99

In [108]:
#Add new columns by calculation some existing columns
data['total'] = data['AIforEveryOne']+data['puthon']+data['git']+data['numpy']
data['percentage'] = (data['total']/400)*100
data['grade'] = [ 'A+' if percent<90.0 else 'A' if 70.0<=percent<80.0 else 'B' for percent in data['percentage'] ]
data

    name  age  AIforEveryOne  puthon  git  numpy  total  percentage grade
0   Asad   23             89      78   90     98    355       88.75    A+
1   Saad   34             78      89   98     87    352       88.00    A+
2  Fahad   23             90      87   87     98    362       90.50     B
3    Ali   21             98      89   86     99    372       93.00     B

In [109]:
#Nested dict of dicts
pop = {
    'Nevada' : {2001: 2.4, 2002: 2.9},
    'Ohio':    {2000: 1.5, 2001: 1.7, 2002: 3.6}
}
df3 = pd.DataFrame(pop)
df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [110]:
#Make Transposes
df3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [111]:
#Note, after taking Transposes, actual DF never change.
df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [112]:
#Adding some new indexs
pop1 = pd.DataFrame(pop, index=[2001, 2002, 2003])
pop1

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [113]:
#Use slice to assign new value in dicts
pdata = {
    'Ohio': df3['Ohio'][:-1],   #slice Ohio column and set value to new column Ohio
    'Nevada': df3['Nevada'][:2] #slice Nevada column and set value to new column Nevada
}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [114]:
#Set row(index) and column name
df3.index.name = 'year'         #Set row(index) name
df3.columns.name = 'state'      #Set column name
df3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

# Index Objects

In [115]:
obj = pd.Series(range(3), index=['a','b','c'])
index = obj.index   #Get all index of obj
index

Index(['a', 'b', 'c'], dtype='object')

In [116]:
#Index slicing
index[1:]

Index(['b', 'c'], dtype='object')

In [117]:
#Change value of index 1
#index[1] = 'd'      #Note: indexes are immutable, we can not be change index values

In [118]:
labels = pd.Index(['a','b','c','d','e','f'])    
labels

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [119]:
#Set labels into frame "dataframe"
frame.index = labels
frame
frame.index
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

# Essential Functionality

In [120]:
frame2.dept = np.arange(6)
print("The frame is", end="\n")
print(frame2, end="\n\n")

print("The row indices are", end="\n")
print(frame2.index, end="\n\n")

print("The col indices are", end="\n")
print(frame2.columns, end="\n\n")

The frame is
       year   state  pop  dept  greaterThenTwo
one    2000    Ohio  1.5     0           False
two    2001    Ohio  1.7     1           False
three  2002    Ohio  3.6     2            True
four   2001  Neveda  2.4     3            True
five   2002  Neveda  2.9     4            True
six    2003  Neveda  3.2     5            True

The row indices are
Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

The col indices are
Index(['year', 'state', 'pop', 'dept', 'greaterThenTwo'], dtype='object')

In [121]:
#Re-index
#Note 1: By default "row" are reindex via reindex function
#Note 2: We know that reindex never change orignal data, works on copy of the data 
reindex_frame = frame2.reindex(['five','two','three','six','four','one','seven'])
reindex_frame

         year   state  pop  dept greaterThenTwo
five   2002.0  Neveda  2.9   4.0           True
two    2001.0    Ohio  1.7   1.0          False
three  2002.0    Ohio  3.6   2.0           True
six    2003.0  Neveda  3.2   5.0           True
four   2001.0  Neveda  2.4   3.0           True
one    2000.0    Ohio  1.5   0.0          False
seven     NaN     NaN  NaN   NaN            NaN

In [122]:
#Columns can be re-index
reindex_frame = frame2.reindex(columns=['pop','year','imports','dept','state','exports'])
reindex_frame

       pop  year  imports  dept   state  exports
one    1.5  2000      NaN     0    Ohio      NaN
two    1.7  2001      NaN     1    Ohio      NaN
three  3.6  2002      NaN     2    Ohio      NaN
four   2.4  2001      NaN     3  Neveda      NaN
five   2.9  2002      NaN     4  Neveda      NaN
six    3.2  2003      NaN     5  Neveda      NaN

In [123]:
#Dropping Entries from an Axis
#Note 1: By default "row" will be drop
#Note 2: label for axis=0 is default set
row_dropped_frame = reindex_frame.drop(['three','six'])
row_dropped_frame

      pop  year  imports  dept   state  exports
one   1.5  2000      NaN     0    Ohio      NaN
two   1.7  2001      NaN     1    Ohio      NaN
four  2.4  2001      NaN     3  Neveda      NaN
five  2.9  2002      NaN     4  Neveda      NaN

In [124]:
#Note: label axis=1 is for column
column_dropped_frame = reindex_frame.drop(['imports','exports'], axis=1)
column_dropped_frame

       pop  year  dept   state
one    1.5  2000     0    Ohio
two    1.7  2001     1    Ohio
three  3.6  2002     2    Ohio
four   2.4  2001     3  Neveda
five   2.9  2002     4  Neveda
six    3.2  2003     5  Neveda

# Another Example

In [129]:
index = ['Firefox','Chrome','Safari','IE10','Konqueror']
df = pd.DataFrame({
    'http_status':  [200,200,404,404,301],
    'responce_time': [0.04, 0.02, 0.07, 0.08, 1.0],
},index=index)
df

           http_status  responce_time
Firefox            200           0.04
Chrome             200           0.02
Safari             404           0.07
IE10               404           0.08
Konqueror          301           1.00

In [130]:
#reindex
new_index = ['Safari', 'Iceweasel', 'Comodo Dragon', 'IE10', 'Chrome']
df.reindex(new_index)

               http_status  responce_time
Safari               404.0           0.07
Iceweasel              NaN            NaN
Comodo Dragon          NaN            NaN
IE10                 404.0           0.08
Chrome               200.0           0.02

In [131]:
#fill missing value with 0
df.reindex(new_index, fill_value=0)

               http_status  responce_time
Safari                 404           0.07
Iceweasel                0           0.00
Comodo Dragon            0           0.00
IE10                   404           0.08
Chrome                 200           0.02

In [132]:
#fill missing value with missing string
df.reindex(new_index, fill_value='missing')

              http_status responce_time
Safari                404          0.07
Iceweasel         missing       missing
Comodo Dragon     missing       missing
IE10                  404          0.08
Chrome                200          0.02

In [136]:
#Column re-indexing,there ar two ways
df.reindex(columns=['http_status','user_agent'])          #Both are same
df.reindex(['http_status','user_agent'], axis="columns")  #Both are same (axis style)

           http_status  user_agent
Firefox            200         NaN
Chrome             200         NaN
Safari             404         NaN
IE10               404         NaN
Konqueror          301         NaN

In [151]:
date_index = pd.date_range('1/1/2010', periods=6, freq='D')
df2 = pd.DataFrame( {"prices": [100, 101, np.nan, 100, 89, 88]}, index=date_index)
df2

            prices
2010-01-01   100.0
2010-01-02   101.0
2010-01-03     NaN
2010-01-04   100.0
2010-01-05    89.0
2010-01-06    88.0

In [145]:
#re-indexing with dates
date_index2 = pd.date_range('12/29/2009', periods=10, freq='D')
df2.reindex(date_index2)

            prices
2009-12-29     NaN
2009-12-30     NaN
2009-12-31     NaN
2010-01-01   100.0
2010-01-02   101.0
2010-01-03     NaN
2010-01-04   100.0
2010-01-05    89.0
2010-01-06    88.0
2010-01-07     NaN

In [153]:
#bfill fill all unindex value with back propogated value, except existing value dated = '2010-01-03', remain unchange
df2.reindex(date_index2, method='bfill')

            prices
2009-12-29   100.0
2009-12-30   100.0
2009-12-31   100.0
2010-01-01   100.0
2010-01-02   101.0
2010-01-03     NaN
2010-01-04   100.0
2010-01-05    89.0
2010-01-06    88.0
2010-01-07     NaN

# Indexing, Selection, and Filtering

In [158]:
data = pd.DataFrame(np.arange(40).reshape((10,4)), index=['Ohio','Colorado','Washington','Nebraska','Utah','New Yark','Califorina','Texas','Georgega','Alaska'], columns=['Jan','Fab','Mar','Apr'])
data

            Jan  Fab  Mar  Apr
Ohio          0    1    2    3
Colorado      4    5    6    7
Washington    8    9   10   11
Nebraska     12   13   14   15
Utah         16   17   18   19
New Yark     20   21   22   23
Califorina   24   25   26   27
Texas        28   29   30   31
Georgega     32   33   34   35
Alaska       36   37   38   39

In [160]:
#Getting single column (label based)
data['Jan']

Ohio           0
Colorado       4
Washington     8
Nebraska      12
Utah          16
New Yark      20
Califorina    24
Texas         28
Georgega      32
Alaska        36
Name: Jan, dtype: int32

In [162]:
#Getting multiple columns (label based)
data[['Jan','Apr']]

            Jan  Apr
Ohio          0    3
Colorado      4    7
Washington    8   11
Nebraska     12   15
Utah         16   19
New Yark     20   23
Califorina   24   27
Texas        28   31
Georgega     32   35
Alaska       36   39

In [164]:
#Getting columns (integer based), in integer base slicing "0" can not included
data[:2]        #both are same, slicing rows from 0 and take 2 rows
data[0:2]       #both are same, slicing rows from 0 and take 2 rows

          Jan  Fab  Mar  Apr
Ohio        0    1    2    3
Colorado    4    5    6    7

In [166]:
#Getting columns (label based), in label base slicing "Utah" will be included
data[:"Texas"]              #both are same, slicing rows from 0 and take 2 rows
data["Utah":"Texas"]        #both are same, slicing rows from 0 and take 2 rows

            Jan  Fab  Mar  Apr
Utah         16   17   18   19
New Yark     20   21   22   23
Califorina   24   25   26   27
Texas        28   29   30   31

In [169]:
#Slicing subset of "rows" and "columns", (Label based)
data.loc["Utah":"Texas", "Jan":"Mar"]

            Jan  Fab  Mar
Utah         16   17   18
New Yark     20   21   22
Califorina   24   25   26
Texas        28   29   30

In [170]:
#Slicing subset of "rows" and "columns", (integer based)
data.iloc[2:6, 0:2]

            Jan  Fab
Washington    8    9
Nebraska     12   13
Utah         16   17
New Yark     20   21

In [172]:
a = pd.DataFrame({"p": [2,4,6]})
a.div(2)                #Divide by 2
a.rdiv(2)               #Divide by 2 (reverse divide by)

          p
0  1.000000
1  0.500000
2  0.333333

In [173]:
#Get monthwise record in bool
data['Mar'] > 20

Ohio          False
Colorado      False
Washington    False
Nebraska      False
Utah          False
New Yark       True
Califorina     True
Texas          True
Georgega       True
Alaska         True
Name: Mar, dtype: bool

In [175]:
#Get monthwise record
data[data['Mar'] > 20]

            Jan  Fab  Mar  Apr
New Yark     20   21   22   23
Califorina   24   25   26   27
Texas        28   29   30   31
Georgega     32   33   34   35
Alaska       36   37   38   39

In [180]:
#Set "0" where data has value less then 5
data[data < 5] = 0
data

            Jan  Fab  Mar  Apr
Ohio          0    0    0    0
Colorado      0    5    6    7
Washington    8    9   10   11
Nebraska     12   13   14   15
Utah         16   17   18   19
New Yark     20   21   22   23
Califorina   24   25   26   27
Texas        28   29   30   31
Georgega     32   33   34   35
Alaska       36   37   38   39